In [29]:
import pandas as pd

In [30]:
inspections = pd.read_csv("./data/chicago_food_inspections.csv")

In [31]:
inspections

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [32]:
inspections["Name"].head()

0     MARRIOT MARQUIS CHICAGO
1                    JETS PIZZA
2                     ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                  CHARTWELLS
Name: Name, dtype: object

In [33]:
inspections["Name"].head().str.startswith(" ")

0    True
1    True
2    True
3    True
4    True
Name: Name, dtype: bool

In [34]:
inspections["Name"].head().values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [35]:
dessert = "     cheesecake      "

In [36]:
dessert

'     cheesecake      '

In [37]:
dessert.lstrip()

'cheesecake      '

In [38]:
dessert.rstrip()

'     cheesecake'

In [39]:
dessert.strip()

'cheesecake'

In [40]:
inspections["Name"] = inspections["Name"].str.strip()

In [41]:
inspections["Name"].head().str.startswith(" ")

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [42]:
inspections["Name"].head().str.endswith(" ")

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [43]:
for column in inspections.columns:
    inspections[column] = inspections[column].str.strip()

In [45]:
inspections["Name"].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [46]:
inspections["Name"].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

In [47]:
inspections["Risk"].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: object

In [49]:
inspections["Risk"].str.split().head()

0      [Risk, 1, (High)]
1    [Risk, 2, (Medium)]
2       [Risk, 3, (Low)]
3      [Risk, 1, (High)]
4      [Risk, 1, (High)]
Name: Risk, dtype: object

In [57]:
inspections["Risk"][0].split()[2]

'(High)'

In [58]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [63]:
len(inspections["Risk"].unique())

5

In [64]:
inspections = inspections.replace(
    to_replace= 'All', value= "Risk 4 (Extreme)"
)

In [65]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)', nan], dtype=object)

In [72]:
inspections[inspections['Risk'] == "Risk 1 (High)"].count()

Name    107351
Risk    107351
dtype: int64

In [73]:
inspections[inspections['Risk'] == "Risk 2 (Medium)"].count()

Name    31845
Risk    31845
dtype: int64

In [74]:
inspections[inspections['Risk'] == "Risk 3 (Low)"].count()

Name    14529
Risk    14529
dtype: int64

In [75]:
inspections[inspections['Risk'] == "Risk 4 (Extreme)"].count()

Name    19
Risk    19
dtype: int64

In [76]:
high = inspections[inspections['Risk'] == "Risk 1 (High)"].count()
medium = inspections[inspections['Risk'] == "Risk 2 (Medium)"].count()
low = inspections[inspections['Risk'] == "Risk 3 (Low)"].count()
extreme = inspections[inspections['Risk'] == "Risk 4 (Extreme)"].count()

In [77]:
high + medium + low + extreme

Name    153744
Risk    153744
dtype: int64

In [79]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)', nan], dtype=object)

In [80]:
inspections["Risk"].count()

153744

In [85]:
import numpy as  np
from numpy import nan

In [88]:
inspections[inspections['Risk'] == nan].count()

Name    0
Risk    0
dtype: int64

In [89]:
inspections["Risk"].str.slice(5, 6).head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [90]:
inspections["Risk"].str[5:6].head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [93]:
inspections["Risk"].str[7:].head()

0      (High)
1    (Medium)
2       (Low)
3      (High)
4      (High)
Name: Risk, dtype: object

In [94]:
inspections["Risk"].str[8:-1].head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [98]:
has_pizza = inspections["Name"].str.lower().str.contains("pizza")
inspections[has_pizza]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3993 rows x 2 columns]

In [99]:
inspections[has_pizza].count()

Name    3993
Risk    3992
dtype: int64

In [100]:
start_with_tacos = (
    inspections["Name"].str.lower().str.startswith("tacos")
                    )

In [101]:
inspections[start_with_tacos]

                         Name           Risk
69               TACOS NIETOS  Risk 1 (High)
556       TACOS EL TIO 2 INC.  Risk 1 (High)
675          TACOS DON GABINO  Risk 1 (High)
958       TACOS EL TIO 2 INC.  Risk 1 (High)
1036      TACOS EL TIO 2 INC.  Risk 1 (High)
...                       ...            ...
143587          TACOS DE LUNA  Risk 1 (High)
144026           TACOS GARCIA  Risk 1 (High)
146174        Tacos Place's 1  Risk 1 (High)
147810  TACOS MARIO'S LIMITED  Risk 1 (High)
151191            TACOS REYNA  Risk 1 (High)

[105 rows x 2 columns]

In [102]:
inspections[start_with_tacos].count()

Name    105
Risk    105
dtype: int64

In [105]:
end_with_tacos = (
    inspections["Name"].str.lower().str.endswith("tacos")
)

In [106]:
inspections[end_with_tacos]

                   Name           Risk
382        LAZO'S TACOS  Risk 1 (High)
569        LAZO'S TACOS  Risk 1 (High)
2652       FLYING TACOS   Risk 3 (Low)
3250       JONY'S TACOS  Risk 1 (High)
3812       PACO'S TACOS  Risk 1 (High)
...                 ...            ...
151121      REYES TACOS  Risk 1 (High)
151318   EL MACHO TACOS  Risk 1 (High)
151801   EL MACHO TACOS  Risk 1 (High)
153087  RAYMOND'S TACOS  Risk 1 (High)
153504        MIS TACOS  Risk 1 (High)

[304 rows x 2 columns]

In [107]:
inspections[end_with_tacos].count()

Name    304
Risk    304
dtype: int64

In [110]:
customers = pd.read_csv("./data/customers.csv")

In [111]:
customers.head()

                  Name                                            Address
0        Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1    Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2      Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3  Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4       Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...

In [112]:
customers["Name"].str.len().head()

0    13
1    17
2    15
3    19
4    14
Name: Name, dtype: int64

In [113]:
customers["Name"].str.split(" ").head()

0           [Frank, Manning]
1       [Elizabeth, Johnson]
2         [Donald, Stephens]
3    [Michael, Vincent, III]
4          [Jasmine, Zamora]
Name: Name, dtype: object

In [114]:
customers["Name"].str.split(" ").str.len().head()

0    2
1    2
2    2
3    3
4    2
Name: Name, dtype: int64

In [115]:
customers["Name"].str.split(pat=" ", n=1).head()

0          [Frank, Manning]
1      [Elizabeth, Johnson]
2        [Donald, Stephens]
3    [Michael, Vincent III]
4         [Jasmine, Zamora]
Name: Name, dtype: object

In [116]:
customers["Name"].str.split(pat=" ", n=1)[0]

['Frank', 'Manning']

In [118]:
customers["Name"].str.split(pat=" ", n=1).str[0].head()

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

In [119]:
customers["Name"].str.split(pat=" ", n=1).str.get(0).head()

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

In [120]:
customers["Name"].str.split(pat=" ", n=1).str.get(1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [124]:
customers["Name"].str.split(
    pat=" ", n=1, expand=True
).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

In [125]:
customers[["Fisrt Name","Last Name"]] = customers["Name"].str.split(pat=" ", n=1, expand=True)

In [126]:
customers.head()

,Name,Address,Fisrt Name,Last Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora

In [127]:
customers.drop("Name",axis=1)

,Address,Fisrt Name,Last Name
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [131]:
customers["Address"].str.split(pat=",",n=3, expand=True)

                               0              1               2       3
0              6461 Quinn Groves   East Matthew   New Hampshire   16656
1     1360 Tracey Ports Apt. 419       Kyleport         Vermont   31924
2           19120 Fleming Manors    Prestonstad         Montana   23495
3               441 Olivia Creek     Jimmymouth         Georgia   82991
4     4246 Chelsey Ford Apt. 310      Karamouth            Utah   76252
...                          ...            ...             ...     ...
9956   762 Andrew Views Apt. 254     North Paul      New Mexico   28889
9957    44188 Day Crest Apt. 901    Lake Marcia           Maine   37378
9958      73015 Michelle Squares    Watsonville   West Virginia   03933
9959            129 Keith Greens      Haleyfurt        Oklahoma   98916
9960          355 Griffin Valley      Davidtown      New Mexico   17581

[9961 rows x 4 columns]

In [132]:
customers[["Street","City","State","Zip"]] = (
    customers["Address"].str.split(pat=",",n=3, expand=True)
)

In [133]:
customers.head()

,Name,Address,Fisrt Name,Last Name,Street,City,State,Zip
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252

In [134]:
customers.drop("Address", axis=1)

,Name,Fisrt Name,Last Name,Street,City,State,Zip
0,Frank Manning,Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth Johnson,Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald Stephens,Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael Vincent III,Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine Zamora,Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...,...,...
9956,Dana Browning,Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda Anderson,Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric Davis,Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor Hernandez,Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry Nicholson,Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

In [135]:
customers["First Name"] = customers["Fisrt Name"]

In [136]:
customers.head()

,Name,Address,Fisrt Name,Last Name,Street,City,State,Zip,First Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656,Frank
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924,Elizabeth
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495,Donald
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991,Michael
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252,Jasmine

In [137]:
customers.drop("Fisrt Name", axis=1)

,Name,Address,Last Name,Street,City,State,Zip,First Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656,Frank
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924,Elizabeth
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Stephens,19120 Fleming Manors,Prestonstad,Montana,23495,Donald
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991,Michael
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252,Jasmine
...,...,...,...,...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889,Dana
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378,Amanda
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Davis,73015 Michelle Squares,Watsonville,West Virginia,03933,Eric
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916,Taylor
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581,Sherry

In [139]:
customers = customers.drop(["Address","Fisrt Name"], axis=1)

In [140]:
customers

,Name,Last Name,Street,City,State,Zip,First Name
0,Frank Manning,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656,Frank
1,Elizabeth Johnson,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924,Elizabeth
2,Donald Stephens,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495,Donald
3,Michael Vincent III,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991,Michael
4,Jasmine Zamora,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252,Jasmine
...,...,...,...,...,...,...,...
9956,Dana Browning,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889,Dana
9957,Amanda Anderson,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378,Amanda
9958,Eric Davis,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933,Eric
9959,Taylor Hernandez,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916,Taylor
9960,Sherry Nicholson,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581,Sherry